## 1.5 Языки программирования, типы данных, структуры управления и алгоритмы

### Языки программирования

1. **Python** - относительно простой язык с минималистичным синтаксисом. (UserFriendly)
Где используется - нейронные сети, Data Science и машинное обучение.

2. **С** - один из самых старых и популярных языков программирования. Он "легкий" и быстрый, поэтмоу его используют там, где нужна высокая производительность. Например - создание драйверов, операционных систем.

3. **С++** - кроссплатформенный язык семейства С с расширенными функциями
на нем так же сожно создавать операционные системы, драйверы и утилиты.

4. **С# (си шарп)** - язык, изначально придуманный компанией Майкрософт, чтобы создавать приложения под Windows.

5. **JavaScript** - быстрый кроссплатформенный язык для веб-разработки (фронт). На нем удобно создавать мобильные и декстопные приложения, которые будут работать через браузер (например - Discord)

6. **Java** - кроссплатформенный язык с большим количеством библиотек и большим сообществом разработчиков.
Кроссплатформеность - это возможность написать программу один раз и пользоваться ею на разных операционных системах: Windows, Linux И MacOS

**Java** - это язык для всего. На нем пишут мобильные приложения, серверы и другие программы. За счет того, что язык не новый, на данный момент на нем написано очень много приложений. А эти приложения - нужно поддерживать.

### Типы данных в Java

Делятся на два типа:
- Примитивные
- Ссылочные

```JAVA
int number = 10; //int - это примитив. Переменная 'number' содержит в себе значение 10, а не какую либо ссылку

String text = "hello world"; //String - это уже ссылочные данные. Это значит, что в объектной перменной 'text' лежит не "hello world", а ссылка на участок памяти, где лежит "hello world"
```

- Примитивы:
 * Целочисленные:
  - byte (1 байт)
  - short (2 байта)
  - int (4 байта)
  - long (8 байт)
 * Вещественные (числа с плавающей точкой - 3.5, 167.934 и т.д.):
  - float(4 байта)
  - double (8 байт)
 * Символьный - буквы и цифры в одинарных кавычках. Пример - 'F'. 'F', '456', '\u0001'
 * Логический - true / false


- Ccылочные типы данных:
Это все остальное в Java.

Ссылочный тип данных - это классы, интерфейсы, листы, массивы. (Абсолютно все)

***

## Алгоритм

**Алгоритм** - это последовательность действий, направленные на решение какой либо задачи. 

Свойства алгоритма:
* Ввод - алгоритм в самом начале получает какие либо данные
* Вывод - по итогу работы алгоритма мы получаем конкретный результат
* Конечность - алгоритм должен быть конечным. Он должен заканчиваться.
* Эффективность - должен быть результат 
* Однозначность - каждый раз при одинаковых вводных данных, всегда должен получаться одинаковый результат

## Структуры управления

Их три:
* Линейная структура
```JAVA
//Мини программа, которая складывает два числа
//Структура данной программы - линейная, т.к. нет никаких внешних условий
//или чего то еще, что бы ход работы программы изменился - например, мы бы получили результат 76
//Сколько бы программа не запускалась, работа программы идет по одному и тому же сценарию
//Мы всегда получим 25 
class SumTwoNumbers {
	public static void main(String[] args) {
		int a = 10;
		int b = 15;
		int result = a + b;
	}
}
```
* Условие
```JAVA
//Мини программа на проверку знака числа (и 0)
//У данной программа три сценария работы, которые зависят от, введенных пользователем, данных
//Структура данной программы - условие, т.к. ход работы программы может быть разный
class CheckNumber {
	public static void main(String[] args) {
		//Создаем объект, через который пользователь будет вводить данные
		Scanner scanner = new Scanner(System.in);
		//Вводим данные и сохраняем их в переменную result
		int result = scanner.nextInt();
		//Если ввели меньше 0, то
		if (result < 0) {
			//Распечатываем это предложение
			System.out.println("Вы ввели отрицательное число");
		//Если ввели 0, то
		} else if (result == 0) {
			//Распечатываем это предложение
			System.out.println("Вы ввели 0");
		//Ну и все остальное, то	
		} else {
			//Распечатываем это предложение
			System.out.println("Вы ввели положительное число")
		}
	}
}
```
* Цикл
```JAVA
//Мини программа на поиск фаториала числа 
//- Факториал для 3 = 1 * 2 * 3 = 6
//- Факториал для 4 = 1 * 2 * 3 * 4 = 24
//- Факториал для 5 = 1 * 2 * 3 * 4 * 5 = 120 и т.д.

//У данной программа один сценарий работы, он выполнен через цикл, т.е. определенный участок кода
//выполняется определенное количество раз, пока выполняется условие, для цикла
//Структура данной программы - цикл, т.к. в ходе работы программы выполняется цикл
class Factorial {
	public static void main(String[] args) {
		//Создаем объект, через который пользователь будет вводить данные
		Scanner scanner = new Scanner(System.in);
		//Вводим данные и сохраняем их в переменную result
		int number = scanner.nextInt();
		//Переменная, которая будет хранить результат вычисления факториала
		int result = 1;
		//Объявили цикл (код между фигурных скобок будет выполняться, пока условие i <= number - верно)
		for (int i = 1; i <= number; i = i + 1) {
			result = result * i;
		}
		//Выводим на экран предложение
		System.out.println("Факториал числа " + number + " равен " + result);
	}
}
```

Теорема Бема-Якопини - любой алгоритм можно выразить с помощью структур, написанных выше

> Оператор '%' - данный оператор берет остаток от деления.
> 
> а = 11%2; -> a = 1;
> а = 11/2; -> a = 5;
> 
> a = 10%2; -> a = 0;
> a = 10/2; -> a = 5;
> 
> 10 = 2 + 2 + 2 + 2 + 2;
> 10 = 5 * 2;

## Задачи на лекции

* 1. Сумма всех чисел последовательности


## Задачи на дом
По аналогии с классной задачкой решить две задачи:

* 1. Минимальное число среди всей последовательности (Д/З)
* 2. Посчитать количество всех четных чисел и нечетных (Д/З)


Условие:

Есть последовательность чисел

**а0, а1, а2 ... аN**

**N -> бесконечность, aN -> -1**

> В Java один знак равно '=' означает присвоение (т.е. мы какой то переменной присваиваем какое то значение). 
> Если нам нужно сравнить два числа - используется знак '=='. Если нужно узнать, что какое то из двух чисел больше, используется либо '>' или '>='
> 
> 5 > a - данное условие будет 'true' (истина), если 'а' меньше 5 (т.е. 4, 3, 2 и т.д.)
> 5 >= a - данное условие будет 'true' (истина), если 'а' меньше или равняется 5 (т.е. 5, 4, 3, 2 и т.д.)
> 5 <= a - данное условие будет 'true' (истина), если 'а' больше или равняется 5 (т.е. 5, 6, 7, 8 и т.д.)
> 5 != a - данное условие будет 'true', если 'a' не равно 5 (т.е. а может равняться абсолютно любым числам, главное - не пяти)
> 
> 5 < x < 10 - в Java так писать нельзя (Java нас не поймет)
> 5 < x && x < 10 - теперь Java ругаться не будет

***
1. 
объявить 'а'
объявить 'сумма' // сумма всех чисел последовательности
считать -> 'a' // положить в 'a' какое либо значение 

пока (a != -1) 

	'сумма' = 'сумма' + 'a' \\ сначала выполняется действие справо от '=', и после этого, новое значение присваивается переменной 'сумма'
	считать -> 'a'

вывести -> 'сумма'
***
